Revit 2026 API

# Reference Properties

---

The Reference type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ElementId | The element id for this reference. |
|  | ElementReferenceType | The type of reference. |
|  | GlobalPoint | The position on which the reference is hit. |
|  | IsReadOnly | Identifies if the object is read-only or modifiable.(Inherited from APIObject) |
|  | LinkedElementId | The id of the top-level element in the linked document that is referred to by this reference. |
|  | UVPoint | The UV parameters of the reference, if the reference contains a face. |

#### Reference

Reference Class

Autodesk.Revit.DB Namespace